## Data Preprocessing Chicago_food_inspections.csv

In [2]:
import pandas as pd
inspections = pd.read_csv("chicago_food_inspections.csv")
inspections

                                      Name             Risk
0               MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                              JETS PIZZA   Risk 2 (Medium)
2                               ROOM 1520      Risk 3 (Low)
3                MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                            CHARTWELLS       Risk 1 (High)
...                                    ...              ...
153805                         WOLCOTT'S      Risk 1 (High)
153806     DUNKIN DONUTS/BASKIN-ROBBINS     Risk 2 (Medium)
153807                           Cafe 608     Risk 1 (High)
153808                        mr.daniel's     Risk 1 (High)
153809                         TEMPO CAFE     Risk 1 (High)

[153810 rows x 2 columns]

In [4]:
#Selection

inspections.iloc[1200:1300]

                                                   Name             Risk
1200                               MOON STAR GROCERY        Risk 3 (Low)
1201                        LE PARIS BAKERY NO 2 INC       Risk 1 (High)
1202                             ARAMARK SERVICES, INC     Risk 1 (High)
1203                                        CHINA CAFE     Risk 1 (High)
1204                     POPEYE'S CHICKEN & BISCUITS       Risk 1 (High)
...                                                 ...              ...
1295                            5 STAR CHICKEN & FISH    Risk 2 (Medium)
1296                        ROSEBUD THEATRE DISTRICT       Risk 1 (High)
1297                                  WAHMEI FOOD CORP     Risk 1 (High)
1298                                      ENERGY HOUSE   Risk 2 (Medium)
1299   3 JJJ'S BETTER TASTE JAMAICAN JERK RESTAURANT       Risk 1 (High)

[100 rows x 2 columns]

In [5]:
#Removing whitespace 

inspections["Name"].str.lstrip().head()

0    MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
3     MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [16]:
#Removing whitespace

inspections["Name"].str.rstrip().head()

0      MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
3      MARRIOT MARQUIS CHICAGO
4                   CHARTWELLS
Name: Name, dtype: object

In [6]:
#Removing whitespace

inspections["Name"].str.strip().head()

0    MARRIOT MARQUIS CHICAGO
1                 JETS PIZZA
2                  ROOM 1520
3    MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [21]:
#Changing to LowerCase

inspections["Name"].str.lower().head()

0    marriot marquis chicago
1                 jets pizza
2                  room 1520
3    marriot marquis chicago
4                 chartwells
Name: Name, dtype: object

In [7]:
#Changing the to  Upper case for the first letter

inspections["Name"].str.capitalize().head()

0     marriot marquis chicago
1                    jets pizza
2                     room 1520
3      marriot marquis chicago
4                  chartwells
Name: Name, dtype: object